<?php
/* * *********************************************************
* 响应code抽离到单独的文件
* @Author  linhecheng<linhechengbush@live.com>
* @Date: 2017/1/13 15:56
* *********************************************************** */

return [
    0 => '成功',
    1 => '参数错误',

    /*系统消息*/
    1001 => '未接收到post参数',
    1002 => '未接收到system/method/params参数',
    1003 => '签名sign错误',
    1004 => '签名sign超时',
    1005 => 'ip不在允许范围内',
    1006 => '不存在这个方法',
    1007 => '当前来源无权访问该接口',
    1008 => '不存在这个控制器',
    1009 => '不存在这个方法',
    1010 => 'nonce错误',
    1011 => '数据提交太频繁！',

    /*用户相关*/
    10001 => '用户名已被注册',
    10002 => '昵称已被注册',
    10003 => '用户不存在',
    10005 => '用户密码错!',
];